# -*- mode: org -*-
#+STARTUP: indent
** Versions
 Emacs and org mode versions

 #+BEGIN_SRC emacs-lisp
 emacs-version
 #+END_SRC

 #+RESULTS:
 : 26.3

 #+BEGIN_SRC emacs-lisp
 (org-version)
 #+END_SRC

 #+RESULTS:
 : 9.1.9

**** remote

#+BEGIN_SRC emacs-lisp :results none
(setenv "WORKON_HOME" "/sshx:manx:/home/ec2-user/.local/share/virtualenvs")
(set 'pyvenv-workon "ec2-user-zzkNbF-x")
#+END_SRC

#+BEGIN_SRC shell
python -V 2>&1
#+END_SRC

#+BEGIN_SRC text :tangle ~/Downloads/remote-python
#!/usr/bin/env bash
ssh manx -t "/home/ec2-user/.local/share/virtualenvs/ec2-user-zzkNbF-x/bin/ipython $@"
#+END_SRC

Append executable to path

#+BEGIN_SRC emacs-lisp
(when (is-linux-p) (append-to-path "~/Downloads/remote-python"))
#+END_SRC

#+RESULTS:
| ~/Downloads/remote-python | /sshx:manx:/home/ec2-user/.local/share/virtualenvs/ec2-user-zzkNbF-x/bin | /usr/local/WordNet-3.0/bin | /usr/local/julia/julia-current/bin | ~/.pyenv/shims/python | /home/ANT.AMAZON.COM/yizhx/.local/share/umake/bin | /usr/local/sbin | /usr/local/bin | /usr/sbin | /usr/bin | /sbin | /bin | /usr/games | /usr/local/games | /snap/bin | /usr/lib/x86_64-linux-gnu/emacs/26.3/x86_64-linux-gnu |

#+BEGIN_SRC emacs-lisp
(setq python-shell-interpreter "~/Downloads/remote-python" python-shell-interpreter-args "--simple-prompt -i")
#+END_SRC

**** inline source code

#+begin_src python :session sess_calc :exports code :results none
a = 5 + 5
b = a + 5
#+end_src

Another inline example: the result of the calculation is src_python[:session calc]{a}

- test with result in a list: src_python[:session sess_calc]{a}
  + src_python[:session sess_calc]{a} vs src_python[:session sess_calc]{b}
  + 1 + 1 = src_python[:exports code]{ return 1 + 1 }

Another example using value raw option ([[https://orgmode.org/manual/results.html][link]])

#+begin_src python :session calc :exports code :results values raw
a = 5 + 5
b = a-1
ares = '#+MACRO: a '+ str(a)
bres = '#+MACRO: b '+ str(b)
ares + '\n' + bres
#+end_src

#+RESULTS:
#+MACRO: a 10
#+MACRO: b 9

The result is still {{{a}}} and b is {{{b}}}. The key is source code
block needs to evaluated first before export.

